modm-ext/archive-stmicro-svd/rm_rm0316_stm32f303cbt6.svd
      <fields>
        <field>
          <name>SPI1_RX_DMA_RMP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>SPI1_TX_DMA_RMP</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>I2C1_RX_DMA_RMP</name>
          <bitOffset>4</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>I2C1_TX_DMA_RMP</name>
          <bitOffset>6</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>ADC2_DMA_RMP</name>
          <bitOffset>8</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>10</bitOffset>
          <bitWidth>22</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>OPAMP</name>
      <baseAddress>0x40010000</baseAddress>
      <register>
        <name>OPAMP1_CSR</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>OPAMP1EN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FORCE_VP</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VP_SEL</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VM_SEL</name>
          <bitOffset>5</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>TCM_EN</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VMS_SEL</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VPS_SEL</name>
          <bitOffset>9</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>CALON</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CALSEL</name>
          <bitOffset>12</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>PGA_GAIN</name>
          <bitOffset>14</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>USER_TRIM</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TRIMOFFSETP</name>
          <bitOffset>19</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>TRIMOFFSETN</name>
          <bitOffset>24</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>TSTREF</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OUTCAL</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LOCK</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>OPAMP2_CSR</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>OPAMP2EN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FORCE_VP</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VP_SEL</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VM_SEL</name>
          <bitOffset>5</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>TCM_EN</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VMS_SEL</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VPS_SEL</name>
          <bitOffset>9</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>CALON</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CALSEL</name>
          <bitOffset>12</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>PGA_GAIN</name>
          <bitOffset>14</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>USER_TRIM</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TRIMOFFSETP</name>
          <bitOffset>19</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>TRIMOFFSETN</name>
          <bitOffset>24</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>TSTREF</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OUTCAL</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LOCK</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>OPAMP3_CSR</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>OPAMP3EN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FORCE_VP</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VP_SEL</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VM_SEL</name>
          <bitOffset>5</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>TCM_EN</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VMS_SEL</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VPS_SEL</name>
          <bitOffset>9</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>CALON</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CALSEL</name>
          <bitOffset>12</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>PGA_GAIN</name>
          <bitOffset>14</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>USER_TRIM</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TRIMOFFSETP</name>
          <bitOffset>19</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>TRIMOFFSETN</name>
          <bitOffset>24</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>TSTREF</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OUTCAL</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LOCK</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>OPAMP4_CSR</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>OPAMP4EN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FORCE_VP</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VP_SEL</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VM_SEL</name>
          <bitOffset>5</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>TCM_EN</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VMS_SEL</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VPS_SEL</name>
          <bitOffset>9</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>CALON</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CALSEL</name>
          <bitOffset>12</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>PGA_GAIN</name>
          <bitOffset>14</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>USER_TRIM</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TRIMOFFSETP</name>
          <bitOffset>19</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>TRIMOFFSETN</name>
          <bitOffset>24</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>TSTREF</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OUTCAL</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LOCK</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>COMP</name>
      <baseAddress>0x40010000</baseAddress>
      <register>
        <name>COMP1_CSR</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>COMP1EN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP1_INP_DAC</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP1MODE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>COMP1INSEL</name>
          <bitOffset>4</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>7</bitOffset>
          <bitWidth>23</bitWidth>
        </field>
        <field>
          <name>COMP1OUTSEL</name>
          <bitOffset>10</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>COMP1POL</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP1HYST</name>
          <bitOffset>16</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>COMPx_BLANKING</name>
          <bitOffset>18</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>COMP1OUT</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP1LOCK</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>COMP2_CSR</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>COMP2EN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP2_INP_DAC</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP2MODE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>COMP2INMSEL</name>
          <bitOffset>4</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>COMP2INSEL</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>8</bitOffset>
          <bitWidth>22</bitWidth>
        </field>
        <field>
          <name>COMP2WINMODE</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP2OUTSEL</name>
          <bitOffset>10</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>COMP2POL</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP2_BLANKING</name>
          <bitOffset>18</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>COMP2OUT</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP2LOCK</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>COMP3_CSR</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>COMP3EN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>1</bitOffset>
          <bitWidth>29</bitWidth>
        </field>
        <field>
          <name>COMP3MODE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>COMP3INMSEL</name>
          <bitOffset>4</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>COMP3INSEL</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP3OUTSEL</name>
          <bitOffset>10</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>COMP3POL</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP3HYST</name>
          <bitOffset>16</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>COMP3_BLANKING</name>
          <bitOffset>18</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>COMP3OUT</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP3LOCK</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>COMP4_CSR</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>COMP4EN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>1</bitOffset>
          <bitWidth>29</bitWidth>
        </field>
        <field>
          <name>COMP4MODE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>COMP4INMSEL</name>
          <bitOffset>4</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>COMP4INSEL</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP4WINMODE</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP4OUTSEL</name>
          <bitOffset>10</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>COMP4POL</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP4_BLANKING</name>
          <bitOffset>18</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>COMP4OUT</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP4LOCK</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>COMP5_CSR</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>COMP5EN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>1</bitOffset>
          <bitWidth>29</bitWidth>
        </field>
        <field>
          <name>COMP5MODE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>COMP5INMSEL</name>
          <bitOffset>4</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>COMP5INSEL</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP5OUTSEL</name>
          <bitOffset>10</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>COMP5POL</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP5HYST</name>
          <bitOffset>16</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>COMP5_BLANKING</name>
          <bitOffset>18</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>COMP5OUT</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP5LOCK</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>COMP6_CSR</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>COMP6EN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>1</bitOffset>
          <bitWidth>29</bitWidth>
        </field>
        <field>
          <name>COMP6MODE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>COMP6INMSEL</name>
          <bitOffset>4</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>COMP6INSEL</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP6WINMODE</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP6OUTSEL</name>
          <bitOffset>10</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>COMP6POL</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP6_BLANKING</name>
          <bitOffset>18</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>COMP6OUT</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP6LOCK</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>COMP7_CSR</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>COMP7EN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>1</bitOffset>
          <bitWidth>29</bitWidth>
        </field>
        <field>
          <name>COMP7MODE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>COMP7INMSEL</name>
          <bitOffset>4</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>COMP7INSEL</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP7OUTSEL</name>
          <bitOffset>10</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>COMP7POL</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP7HYST</name>
          <bitOffset>16</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>COMP7_BLANKING</name>
          <bitOffset>18</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>COMP7OUT</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>COMP7LOCK</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>EXTI</name>
      <baseAddress>0x40010400</baseAddress>
      <register>
        <name>IMR1</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>EMR1</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>RTSR1</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>23</bitOffset>
          <bitWidth>6</bitWidth>
        </field>
      </fields>
      <register>
        <name>FTSR1</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
